/**
********************************************************************************
*   @file    beep_app.h
*   @author  郝宽宽
*   @version V1.0.0
*   @date    2019-04-24
*   @brief   蜂鸣器接口
********************************************************************************
*/

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __BEEP_APP_H_
#define __BEEP_APP_H_

/* Includes ------------------------------------------------------------------*/
/* Exported types ------------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/
/* Exported macro ------------------------------------------------------------*/
/* Exported functions ------------------------------------------------------- */

void hkk_beep_init(void);
void hkk_beep_on(void);
void hkk_beep_off(void);

#endif /* __BEEP_APP_H_ */

/************************ (C) COPYRIGHT haokuankuan/郝宽宽 ******END OF FILE****/
